import pandas as pd

# Завантаження даних
df = pd.read_csv('billionaire_list_20yrs.csv')

# Виведення перших декількох рядків
print("Перші 5 записів:")
print(df.head())

# Інформація про датасет (типи даних та кількість відсутніх значень)
print("\nІнформація про датасет:")
print(df.info())

# Розрахунок основних статистичних характеристик для числових даних
print("\nОсновні статистичні характеристики:")
print(df.describe())

# Перевірка наявності відсутніх значень в кожному стовпці
print("\nКількість відсутніх значень у кожному стовпці:")
print(df.isnull().sum())
